[
{
"component": "Notifications Admin",
"feature": "Create reminder for all students and send now",
"testType": "Functional",
"priority": "P0",
"preconditions": "School has a default channel configured and at least one active student",
"testSteps": "Open Notifications. Click Add Reminder. Choose All Students. Select a template. Confirm message. Click Send Now.",
"expectedResult": "Messages are dispatched immediately using the school channel. Delivery status is shown. An entry appears in Past."
},
{
"component": "Notifications Admin",
"feature": "Create reminder for specific students and schedule",
"testType": "Functional",
"priority": "P0",
"preconditions": "At least two active students exist",
"testSteps": "Open Notifications. Click Add Reminder. Choose Specific Students and select two students. Select a template. Set a future date and time. Click Create.",
"expectedResult": "A row appears in Upcoming with correct student count, template, date, and time. No messages are sent yet."
},
{
"component": "Student Delivery",
"feature": "Deliver at scheduled time with correct timezone",
"testType": "Functional",
"priority": "P0",
"preconditions": "Reminder is scheduled for a future time in the school timezone and targeted students have valid channel details",
"testSteps": "Wait until the scheduled time.",
"expectedResult": "Messages are delivered within the service window. Timestamps reflect the school timezone. The entry moves to Past."
},
{
"component": "Channel Routing",
"feature": "Send using school configured channel",
"testType": "Functional",
"priority": "P0",
"preconditions": "School channel is set to SMS or WhatsApp or Email",
"testSteps": "Create a reminder and send now.",
"expectedResult": "Messages are sent only via the configured channel. The audit log shows the channel used."
},
{
"component": "Templates",
"feature": "Variable substitution in message templates",
"testType": "Functional",
"priority": "P0",
"preconditions": "Template contains variables such as student_name and cta_section",
"testSteps": "Create a reminder using the template. Preview the message. Send the reminder.",
"expectedResult": "Variables are resolved for each student. No raw placeholders appear in delivered messages."
},
{
"component": "Scheduling",
"feature": "Block past dated scheduling",
"testType": "Functional",
"priority": "P0",
"preconditions": "None",
"testSteps": "Attempt to schedule a reminder with a date and time in the past. Click Create.",
"expectedResult": "A clear validation error is shown and the reminder is not created."
},
{
"component": "Eligibility and Consent",
"feature": "Respect do not contact flag",
"testType": "Security",
"priority": "P0",
"preconditions": "At least one selected student is marked do not contact",
"testSteps": "Create a reminder targeting that student and others. Send now or schedule.",
"expectedResult": "The opted out student is skipped with a visible reason. All other eligible students receive the message."
},
{
"component": "Access Control",
"feature": "Permissions to create and send reminders",
"testType": "Security",
"priority": "P0",
"preconditions": "Teacher role with read only permissions and Admin role with full permissions exist",
"testSteps": "Log in as Teacher and attempt to add a reminder or send now. Log in as Admin and perform the same actions.",
"expectedResult": "Teacher is blocked with a permission error. Admin is allowed to create and send."
},
{
"component": "Failure Handling",
"feature": "Surface failed messages and allow single retry",
"testType": "Integration",
"priority": "P0",
"preconditions": "Provider failure is induced for one recipient",
"testSteps": "Send a reminder. Open Failed Messages. Click Retry for the failed item.",
"expectedResult": "Failure is visible with a reason. A successful retry moves the item to Past. If retry fails, the reason is updated."
},
{
"component": "Engagement",
"feature": "CTA or deep link opens the intended flow",
"testType": "Functional",
"priority": "P0",
"preconditions": "Template includes a deep link to an Addie workflow",
"testSteps": "Deliver the message. As the student, open the link.",
"expectedResult": "The student lands in the intended Addie flow. The event is tracked to the notification identifier."
},
{
"component": "UI List Integrity",
"feature": "Upcoming to Past transition",
"testType": "Functional",
"priority": "P0",
"preconditions": "One reminder is scheduled and another is sent now",
"testSteps": "Send one reminder now. Wait for the scheduled reminder to fire.",
"expectedResult": "Both reminders appear in Past with correct timestamps and final statuses. The scheduled row is removed from Upcoming."
}
]